{"id": "APS234H1F20189", "code": "APS234H1F", "name": "Entrepreneurship and Small Business", "description": "Complementary Studies elective\nPart 1 of the 2 Part Entrepreneurship ProgramThe age of enterprise has arrived. Strategic use of technology in all sorts of businesses makes the difference between success and failure for these firms. Wealth creation is a real option for many and the business atmosphere is ready for you! Increasingly, people are seeing the advantages of doing their own thing, in their own way, in their own time. Entrepreneurs can control their own lives, structure their own progress and be accountable for their own success - they can fail, but they can not be fired! After all, engineers are the most capable people to be in the forefront of this drive to the business life of the next century. This course is the first of a series of two dealing with entrepreneurship and management of a small company. It is intended that the student would continue to take the follow up course APS432 as s/he progresses toward the engineering degree. Therefore, it is advisable that the descriptions of both courses be studied prior to deciding to take this one. This is a limited enrolment course. If the number of students electing to take the course exceeds the class size limit, selection of the final group will be made on the basis of the “Entrepreneur’s Test”. There will be a certificate awarded upon the successful completion of both courses attesting to the fact that the student has passed this Entrepreneurial Course Series at the University of Toronto. The course is based on real life issues, not theoretical developments or untried options. Topics covered include: Who is an entrepreneur; Canadian business environment; Acquisitions; Different business types (retail, wholesale, manufacturing, and services); Franchising; Human resources, Leadership, Business law; and many others. Several visitors are invited to provide the student with the opportunity to meet real entrepreneurs. There will be several assignments and a session project. It should be noted that the 5 hours per week would all be used for whatever is needed at the time, so tutorials will not normally happen as the calendar indicates them.", "division": "Faculty of Applied Science & Engineering", "department": "Cross Disciplinary Programs Office", "prerequisites": "", "exclusions": "CHE488H1/CIV488H1/ECE488H1/MIE488H1/MSE488H1", "level": 200, "campus": "UTSG", "term": "2018 Fall", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["J Paradi"], "times": [{"day": "WEDNESDAY", "start": 64800, "end": 72000, "duration": 7200, "location": "GB 120"}, {"day": "THURSDAY", "start": 64800, "end": 72000, "duration": 7200, "location": "GB 120"}], "size": 104, "enrolment": 0}, {"code": "T0101", "instructors": [], "times": [{"day": "WEDNESDAY", "start": 72000, "end": 75600, "duration": 3600, "location": "GB 120"}], "size": 104, "enrolment": 0}]}