{"id": "APS343H1S20191", "code": "APS343H1S", "name": "Engineering Leadership", "description": "Complementary Studies elective\r\nThis course is a practical approach to being a more productive engineer based on the premise that for technology to become a reality it must be translated through people.  A key is to understand that engineers lead in ways that reflect their skills and mind set.  The course begins with examining: 1) the meaning of leading (Why do something?); 2) the processes of leading (How do you do you create a vision and motivate others?); and 3) the tools of leading (What steps do you take to lead?).  Learning frameworks and personal working styles inventories provide practical tools to assist the student to understand human nature and the logic of learning to become a competent leader of self, teams and organizations.  The student prepares to become a competent leader by undertaking to learn (understand and integrate) key skills, character attributes and purposeful behaviours.  The course presents strategies for development of high performance teams.  Special attention is given to a number of subjects: transformational change, organizational culture, high performance work systems, and self-leadership.  The course material is delivered through lectures, readings, in-class discussion and a team project.  The project is based on the team interviewing the CEO of an engineering-intensive company or senior leader in the community.  Students will be required to submit written reflections on course content and their personal experience.", "division": "Faculty of Applied Science & Engineering", "department": "Cross Disciplinary Programs Office", "prerequisites": "", "exclusions": "", "level": 300, "campus": "UTSG", "term": "2019 Winter", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["P Sheridan"], "times": [{"day": "TUESDAY", "start": 64800, "end": 68400, "duration": 3600, "location": "SF 3201"}], "size": 50, "enrolment": 0}, {"code": "L0102", "instructors": ["E Moore D Reeve"], "times": [{"day": "MONDAY", "start": 64800, "end": 68400, "duration": 3600, "location": "OI 5170"}], "size": 50, "enrolment": 0}, {"code": "P0101", "instructors": [], "times": [{"day": "TUESDAY", "start": 68400, "end": 75600, "duration": 7200, "location": "SF 3201"}], "size": 50, "enrolment": 0}, {"code": "P0102", "instructors": [], "times": [{"day": "MONDAY", "start": 68400, "end": 75600, "duration": 7200, "location": "OI 5170"}], "size": 50, "enrolment": 0}]}