{"id": "APS432H1S20191", "code": "APS432H1S", "name": "Entrepreneurship and Business Management", "description": "Complementary Studies elective\r\nPart 2 of the 2 Part Entrepreneurship Program\r\nThis is part two of the Entrepreneurship course series. The student considering taking this course would typically plan to pursue a career in small business started by him/herself, or in a family enterprise. The skills acquired, however, are very useful in any business where a graduate might end up in his/her career, without the need for actually being an entrepreneur. Our approach to teaching is based on real-life business experiences and many years of successful practice of “what we preach”. The course contains very little theoretical work or academic approaches. It is designed to familiarise you with the kinds of opportunities (problems) likely to be encountered in an entrepreneurial career. If you really want this lifestyle and are prepared to work hard, we will provide you with the practical knowledge and technical skills required to pursue this kind of career. Topics covered in this course include: Marketing and Sales; Legal issues; Financing the business; Human Resources challenges, the Business Plan and many other issues. Note that the course material may be adjusted between the two courses as required. We recognize the value of communication skills in both the classroom and in project reports. In fact, we require that you learn how to present yourself in a business-like manner. As and when appropriate, outside visitors from the business community will join in and contribute to the class discussions. The course deals with practical concepts, actual past and current events and is presented from the point of view of someone who has “done it all”. This means that what you hear is the real stuff. There will be several assignments and the preparation of a full Business Plan as the session project. It should be noted that the 5 hours per week would all be used for whatever is needed at the time, so tutorials will not normally happen as the calendar indicates them.", "division": "Faculty of Applied Science & Engineering", "department": "Cross Disciplinary Programs Office", "prerequisites": "APS234 - Entrepreneurship and Small Business", "exclusions": "CHE488H1/CIV488H1/ECE488H1/MIE488H1/MSE488H1", "level": 400, "campus": "UTSG", "term": "2019 Winter", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["J Patrick J Paradi J Paradi"], "times": [{"day": "WEDNESDAY", "start": 64800, "end": 75600, "duration": 10800, "location": "WB 130"}, {"day": "THURSDAY", "start": 64800, "end": 72000, "duration": 7200, "location": "WB 130"}], "size": 50, "enrolment": 0}]}