{"id": "BME410H1S20191", "code": "BME410H1S", "name": "Regenerative Engineering", "description": "The course encompasses the new multidisciplinary area of Regenerative Engineering by integrating various components of Regenerative Medicine, Clinical Engineering, Human Biology & Physiology, Advanced Biomaterials, Tissue Engineering, and Stem Cell and Developmental Biology, bringing all these disciplines into the clinical perspective of translational medicine. The course starts with the key concepts of stem cell biology and their properties at the cellular and subcellular levels working our way to complex tissues and organs. In the first half of the course, 2D and 3D tissue and organ formation will be our main focus. In the second half, we will discuss the integration of medical devices, technologies and treatments into healthcare as well as clinical trial logistics, ethics and processes. The course materials will integrate cutting-edge research in regenerative medicine and current clinical trials by inviting scientists and clinicians as guest lecturers. Students will be given the rare opportunity to incorporate into their written assignments experiment-based learning via participation in workshops, tours of research facilities, seminars and independent projects integrated into the course during the semester.", "division": "Faculty of Applied Science & Engineering", "department": "Division of Engineering Science", "prerequisites": "BME396H1", "exclusions": "", "level": 400, "campus": "UTSG", "term": "2019 Winter", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["P Gilbert"], "times": [{"day": "FRIDAY", "start": 57600, "end": 61200, "duration": 3600, "location": "ES 4001"}, {"day": "TUESDAY", "start": 54000, "end": 61200, "duration": 7200, "location": ""}], "size": 30, "enrolment": 0}, {"code": "T0101", "instructors": [], "times": [{"day": "FRIDAY", "start": 54000, "end": 57600, "duration": 3600, "location": "ES 4001"}], "size": 30, "enrolment": 0}]}