{"id": "CHE249H1F20189", "code": "CHE249H1F", "name": "Engineering Economic Analysis", "description": "Engineering analysis and design are not ends in themselves, but they are a means for satisfying human wants. Thus, engineering concerns itself with the materials used and forces and laws of nature, and the needs of people. Because of scarcity of resources and constraints at all levels, engineering must be closely associated with economics. It is essential that engineering proposals be evaluated in terms of worth and cost before they are undertaken. In this course we emphasize that an essential prerequisite of a successful engineering application is economic feasibility. Hence, investment proposals are evaluated in terms of economic cost concepts, including break even analysis, cost estimation and time value of money. Effective interest rates, inflation and deflation, depreciation and income tax all affect the viability of an investment. Successful engineering projects are chosen from valid alternatives considering such issues as buy or lease, make or buy, cost and benefits and financing alternatives. Both public sector and for-profit examples are used to illustrate the applicability of these rules and approaches.", "division": "Faculty of Applied Science & Engineering", "department": "Chemical Engineering and Applied Chemistry", "prerequisites": "", "exclusions": "", "level": 200, "campus": "UTSG", "term": "2018 Fall", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["A Chan"], "times": [{"day": "TUESDAY", "start": 57600, "end": 61200, "duration": 3600, "location": "LM 159"}, {"day": "MONDAY", "start": 61200, "end": 64800, "duration": 3600, "location": "LM 159"}, {"day": "FRIDAY", "start": 57600, "end": 61200, "duration": 3600, "location": "LM 159"}], "size": 120, "enrolment": 0}, {"code": "T0101", "instructors": [], "times": [{"day": "MONDAY", "start": 43200, "end": 46800, "duration": 3600, "location": "SF 2202"}], "size": 55, "enrolment": 0}, {"code": "T0102", "instructors": [], "times": [{"day": "MONDAY", "start": 54000, "end": 57600, "duration": 3600, "location": "GB 404"}], "size": 60, "enrolment": 0}]}