{"id": "CPS400Y5Y20189", "code": "CPS400Y5Y", "name": "Chemical and Physical Sciences Internship", "description": "This internship opportunity will allow students to apply theoretical and practical skills acquired during their undergraduate education in order to gain vital industry experience. Students will be trained in effective job searching skills (writing a CV and a Cover Letter, participating in job interviews) and will gain valuable experiences that are sought after by employers in both public and private sectors. Students will be placed with various employers in the GTA based on their interest and skill set, and on the employer needs and availability. The placement is a 200 h unpaid internship. The Course Coordinator/Instructor(s) will schedule biweekly meetings to discuss the setup and progress of the student projects. Student attendance is mandatory. At the end of the term, students must submit a written report and prepare an oral presentation about the outcomes of their work experience. In order to be considered for the internship, students must apply for the course. The Course Coordinator will approve enrolment in the course based on the number of internship opportunities available, which will vary from year-to-year, and student qualifications (e.g. GPA, experience, qualifications related to the requirements of the available placement(s), and interview performance).", "division": "University of Toronto Mississauga", "department": "Chemical and Physical Sciences", "prerequisites": "For Chemistry Internships CHM372H5/394H5/396H5; For Earth Science/Geology Internships ERS301H5, ERS303H5 and an additional 1.0 credit from any 300/400 level courses. For Physics Internships: PHY324H5, PHY347H5 and an additional 1.0 credit from any 300 or 400 level PHY/JCP courses.", "exclusions": "none", "level": 400, "campus": "UTM", "term": "2018 Fall", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["P Gunning"], "times": [], "size": 10, "enrolment": 0}]}