{"id": "EDS325H5F20189", "code": "EDS325H5F", "name": "Supplemental Instruction in Higher Education: The Impact of Peer-Facilitated Study Groups", "description": "This course will introduce students to the theory and practice of Supplemental Instruction (SI) in higher education. Particular focus will be on the history and evolution of SI, the rationale for its use in different university contexts, and it will introduce the relevant tools and resources that facilitators use when running study groups. Current research investigating the impact of Supplemental Instruction on student success will be explored. This course includes a mandatory internship component in which students apply the knowledge acquired in class to their role as a Facilitated Study Group leader in the Peer Facilitated Study Group (FSG) Program run by the Robert Gillespie Academic Skills Centre. Only those students who have successfully secured a volunteer facilitator position in the FSG Program are eligible to enroll in this course. In addition to the lecture and tutorials hours, there will be 100 hours for internship. [24L, 12T]", "division": "University of Toronto Mississauga", "department": "Language Studies", "prerequisites": "Open to all students, but the completion of EDS100H5 or other EDS courses or experience that has directly supported an understanding of teaching and learning is recommended.", "exclusions": "Previous Peer Facilitated Study Group experience in courses like FRE491H5, FRE492H5 or LIN495Y5.", "level": 300, "campus": "UTM", "term": "2018 Fall", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["E Coulson"], "times": [{"day": "TUESDAY", "start": 39600, "end": 46800, "duration": 7200, "location": "NE 3190"}], "size": 60, "enrolment": 0}, {"code": "T0101", "instructors": [], "times": [{"day": "WEDNESDAY", "start": 32400, "end": 36000, "duration": 3600, "location": "NE 3290"}], "size": 25, "enrolment": 0}, {"code": "T0102", "instructors": [], "times": [{"day": "WEDNESDAY", "start": 36000, "end": 39600, "duration": 3600, "location": "NE 3290"}], "size": 25, "enrolment": 0}, {"code": "T0103", "instructors": [], "times": [{"day": "WEDNESDAY", "start": 39600, "end": 43200, "duration": 3600, "location": "NE 3290"}], "size": 25, "enrolment": 0}, {"code": "T0104", "instructors": [], "times": [{"day": "WEDNESDAY", "start": 46800, "end": 50400, "duration": 3600, "location": "NE 3290"}], "size": 25, "enrolment": 0}]}