{"id": "ENV461H1F20189", "code": "ENV461H1F", "name": "The U of T Campus as a Living Lab of Sustainability", "description": "Sustainability is a growing priority for universities all over the world. Many are developing strong operational sustainability goals and targets, and are giving increasing emphasis to teaching and research on sustainability issues. Yet few have committed at the executive level to integrating academic and operational sustainability in the context of treating their campus as a living laboratory of sustainable practice, research and teaching. Arguably, it is such living lab approaches that offer the largest potential for universities to play a significant role in the sustainability transition. This course will explore and apply the living lab concept, in the context of operational sustainability at the University of Toronto. We will begin by looking at the literature on university sustainability and the living lab concept. The bulk of the course will involve undertaking an applied research project on some aspect of campus sustainability, working in close partnership with operational staff at the University of Toronto. Students will develop the skills needed to work across disciplines and fields of study, and with non-academic partners. This course will put students to work on operational sustainability projects identified by the staff working in or with the Sustainability Office at the University of Toronto. Students will be organized into groups, each of which will be assigned one project, to be overseen by one or more U of T staff members. The bulk of the course will consist of regular meetings with the staff “clients”, with instructors, and in small groups to undertake a group project. Each group will produce a mid-term and final report, and give a mid-term and final presentation. Each student will also submit two 360 reviews of the group process. A crucial aspect of this course is the ability of students to work collaboratively together in a group environment, and to work effectively with a university staff person acting as a “client” for their work. Students will be provided with a Handbook outlining information on working in groups and the focus of the class in the second week will be on this issue. The first 360 peer review will serve to provide information on how well each group is working. Students are encouraged to discuss and resolve group process issues in the weekly group meetings, and in their regular meetings with the instructor and TA. The second 360 review will occur at the end of the term. The results of the two 360 reviews will be used, where appropriate, to adjust individual marks from the group averages.", "division": "Faculty of Arts and Science", "department": "School of Environment", "prerequisites": "ENV221H1 and completion of 10 FCE of courses,; or permission of the Academic Associate Director", "exclusions": "ENV481H1 if taken in 2016-17", "level": 400, "campus": "UTSG", "term": "2018 Fall", "breadths": [3], "meeting_sections": [{"code": "L0101", "instructors": ["J Robinson"], "times": [{"day": "TUESDAY", "start": 50400, "end": 57600, "duration": 7200, "location": "OI 5250"}], "size": 30, "enrolment": 0}]}