{"id": "GGR335H5S20191", "code": "GGR335H5S", "name": "GIS and Remote Sensing Integration", "description": "The integration of GIS and remote sensing is at the center of a larger trend toward the fusion of different kinds of geospatial data and technologies. The purpose of this course is to familiarize students with the various ways in which GIS and remote sensing have been integrated and used for environmental applications at a range of spatial and temporal scales. The first one-third of the course will explore vector based GIS analysis in the context of physical environment, wildlife habitat, and human activities using ArcGIS software. The second third of the course explores remote sensing fundamentals, image interpretation, land cover mapping, change detection, and integration of raster and vector data using ERDAS IMAGINE software. The course will include lectures, where foundational concepts will be introduced and practical lab sessions, where students will gain experience on the proper use of GIS and Remote Sensing techniques. There will be guest lectures demonstrating applications of RS and GIS in natural resources management. The final third of the course will be devoted to application projects employing remote sensing and/or GIS data analysis in natural resources and environmental assessments. [24L, 24P]", "division": "University of Toronto Mississauga", "department": "Geography", "prerequisites": "9.0 credits including GGR272H5 or GGR276H5 or GGR278H5 or GGR337H5", "exclusions": "", "level": 300, "campus": "UTM", "term": "2019 Winter", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["X Xu"], "times": [{"day": "MONDAY", "start": 50400, "end": 57600, "duration": 7200, "location": "IB 380"}], "size": 60, "enrolment": 0}, {"code": "P0101", "instructors": [], "times": [{"day": "TUESDAY", "start": 46800, "end": 54000, "duration": 7200, "location": "CC 2140"}], "size": 30, "enrolment": 0}, {"code": "P0102", "instructors": [], "times": [{"day": "TUESDAY", "start": 54000, "end": 61200, "duration": 7200, "location": "CC 2140"}], "size": 30, "enrolment": 0}]}