{"id": "MIE350H1F20189", "code": "MIE350H1F", "name": "Design and Analysis of Information Systems", "description": "Provides students with an understanding of the mothods of information system analysis and design. These include methods for determining and documenting an organization's structure (FDD), activities, behaviours and information flows (DFDs, decision tables and trees, network diagrams, etc); model acquisition (data repositories), verification and validation. Methods such as SADT, RAD and prototyping will be covered. Students will acquire a working knowledge of various frameworks for analysis (e.g., information technology categories, system and application classifications, decision types, data vs information). Throughout the course, emphasis is placed on the importance of systems thinking and organizational culture in the analysis and design process. In the laboratory, students will use a CASE-based computer program (Visible Analyst) for the analysis and design of information systems for selected organizations. Students will be asked to work in teams to create a web-based information site  and to document and present their development progress through the use of a structured project log.", "division": "Faculty of Applied Science & Engineering", "department": "Mechanical & Industrial Engineering", "prerequisites": "MIE253H1", "exclusions": "", "level": 300, "campus": "UTSG", "term": "2018 Fall", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["D Rosu"], "times": [{"day": "WEDNESDAY", "start": 54000, "end": 61200, "duration": 7200, "location": "BA 1130"}, {"day": "MONDAY", "start": 54000, "end": 57600, "duration": 3600, "location": "BA 1130"}], "size": 120, "enrolment": 0}, {"code": "P0101", "instructors": [], "times": [{"day": "TUESDAY", "start": 32400, "end": 36000, "duration": 3600, "location": "GB 150"}, {"day": "TUESDAY", "start": 32400, "end": 36000, "duration": 3600, "location": "GB 144"}], "size": 120, "enrolment": 0}, {"code": "T0101", "instructors": [], "times": [{"day": "THURSDAY", "start": 32400, "end": 36000, "duration": 3600, "location": "MC 252"}], "size": 120, "enrolment": 0}]}