{"id": "MIE443H1S20191", "code": "MIE443H1S", "name": "* Mechatronics Systems: Design and Integration", "description": "The course aims to raise practical design awareness, provide pertinent project engineering methodology, and generate a know-how core in integration of complex automation. This course has mainly practical content, and is integral and useful in the training and education of those students who plan to be employed in areas related to intelligent automation, as well as to the breadth of knowledge of all others. Although emphasis will be on robotic-based automation (mechatronics), the learning will be useful in all domains of system integration. This course will introduce students to the basics of integration, methodology of design, tools, and team project work. The course will be monitored based on projects from a selected list of topics. The lectures will be in format of tutorials as preparation and discussions on project related issues. A main goal is to bring the methods, means and spirit of the industrial design world to the class room. Emphasis will be on understanding the elements of integration, methodology and approaches, and will involve numerous case studies. Specifically the course will provide a practical step-by-step approach to integration: specifications, conceptual design, analysis, modeling, synthesis, simulation and bread-boarding, prototyping, integration, verification, installation and testing. Issues of project management, market, and economics will be addressed as well. Limited Enrolment.", "division": "Faculty of Applied Science & Engineering", "department": "Mechanical & Industrial Engineering", "prerequisites": "MIE346H1", "exclusions": "", "level": 400, "campus": "UTSG", "term": "2019 Winter", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["G Nejat S Franco Dos Reis Alves"], "times": [{"day": "WEDNESDAY", "start": 50400, "end": 57600, "duration": 7200, "location": "WB 116"}], "size": 160, "enrolment": 0}, {"code": "P0101", "instructors": [], "times": [{"day": "TUESDAY", "start": 54000, "end": 72000, "duration": 18000, "location": "MC 402"}], "size": 40, "enrolment": 0}, {"code": "P0102", "instructors": [], "times": [{"day": "THURSDAY", "start": 32400, "end": 50400, "duration": 18000, "location": "MC 402"}], "size": 40, "enrolment": 0}, {"code": "P0103", "instructors": [], "times": [{"day": "TUESDAY", "start": 54000, "end": 72000, "duration": 18000, "location": "MC 215"}], "size": 40, "enrolment": 0}, {"code": "P0104", "instructors": [], "times": [{"day": "THURSDAY", "start": 32400, "end": 50400, "duration": 18000, "location": "MC 215"}], "size": 40, "enrolment": 0}]}