{"id": "MIE488H1F20189", "code": "MIE488H1F", "name": "Entrepreneurship and Business for Engineers", "description": "A complete introduction to small business formation, management and wealth creation. Topics include: the nature of the Entrepreneur and the Canadian business environment; business idea search and Business Plan construction; Buying a business, franchising, taking over a family business; Market research and sources of data; Marketing strategies promotion, pricing, advertising, electronic channels and costing; The sales process and management, distribution channels and global marketing; Accounting, financing and analysis, sources of funding, and financial controls; The people dimension: management styles, recruiting and hiring, legal issues in employment and Human Resources; Legal forms of organization and business formation, taxation, intellectual property protection; the e-Business world and how businesses participate; Managing the business: location and equipping the business, suppliers and purchasing, credit, ethical dealing; Exiting the business and succession, selling out. A full Business Plan will be developed by each student and the top submissions will be entered into a Business Plan competition with significant cash prices for the winners. Examples will be drawn from real business situations including practicing entrepreneurs making presentations and class visits during the term. (Identical courses are offered: ECE488H1F, MSE488H1F, CHE488H1S and CIV488H1S.)\r\n*Complementary Studies Elective", "division": "Faculty of Applied Science & Engineering", "department": "Mechanical & Industrial Engineering", "prerequisites": "", "exclusions": "APS234 and APS432", "level": 400, "campus": "UTSG", "term": "2018 Fall", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["J Paradi J Orozco"], "times": [{"day": "WEDNESDAY", "start": 43200, "end": 54000, "duration": 10800, "location": "BA B026"}], "size": 65, "enrolment": 0}, {"code": "T0101", "instructors": [], "times": [{"day": "TUESDAY", "start": 43200, "end": 50400, "duration": 7200, "location": "SF 3201"}], "size": 65, "enrolment": 0}]}