{"id": "MIN225H1F20189", "code": "MIN225H1F", "name": "Introduction to the Resource Industries", "description": "This course introduces the global resource industries in three parts. In Module 1, students learn about mineral resources in the economy, the origin of ore deposits, mineral exploration and processing techniques, land ownership and environmental issues. Engineering applications are emphasized. Exploration and development topics are investigated. Module 2 presents an introduction to modern mining engineering. The basics of both surface (open pit) and sub-surface mining is covered. Module 3 presents an introduction on the processing of mineral resources into metals. The course helps to develop communication skills through student presentations on current issues in the industry and through training in technical communications by faculty from the Engineering Communications Program. Training for AutoCad and an extensive communications module are provided in the laboratory section. Students will participate in a field trip to an operating mine. *Only students enrolled in the Lassonde Mineral Engineering program are eligible to participate in the 2nd year field trip.", "division": "Faculty of Applied Science & Engineering", "department": "Civil and Mineral Engineering", "prerequisites": "", "exclusions": "", "level": 200, "campus": "UTSG", "term": "2018 Fall", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["I Hadjigeorgiou R Moss"], "times": [{"day": "FRIDAY", "start": 32400, "end": 39600, "duration": 7200, "location": "SS 2108"}, {"day": "THURSDAY", "start": 32400, "end": 36000, "duration": 3600, "location": "MY 430"}], "size": 30, "enrolment": 0}, {"code": "P0101", "instructors": [], "times": [{"day": "FRIDAY", "start": 43200, "end": 50400, "duration": 7200, "location": "MB 400"}], "size": 30, "enrolment": 0}, {"code": "T0101", "instructors": [], "times": [{"day": "THURSDAY", "start": 36000, "end": 39600, "duration": 3600, "location": "MY 430"}], "size": 30, "enrolment": 0}]}