{"id": "MIN467H1S20191", "code": "MIN467H1S", "name": "Mineral Project Design II", "description": "Mineral Project Design is a two-part capstone course that draws on all course materials developed in the first three years of the Mineral Engineering Curriculum. Part II (S) focuses on the design of a mining or civil rock engineering project. Students will be grouped into teams and provided with one or more data sets and a design problem to solve. The end product is a major engineering design report and oral presentation (including several interim reports and presentations). Technical aspects will serve to examine a “cradle to grave” view of a project, from initial planning through to final closure and site remediation. The course will include an intensive two-day Professional Supervisors Short Course. Topics include: Discovering a commonality among supervisors and their key role in maintaining standards. The importance of sharing information and expectations about costs, production goals and business objectives are explored in the context of motivation. The necessity of successful communication skills and techniques are discussed and demonstrated to achieve behaviours on the job, producing consistent results. A reliable methodology for handling difficult situations is provided. The fundamental rationale for safety and loss control is presented as well as a relevant perspective on management structure. A workable code of conduct that is a guide to professional behaviour is developed. Students will receive a final grade at the end of each term course, but both courses must be taken in sequence (MIN 467H1 S cannot be taken without successful completion of MIN 466H1 F)", "division": "Faculty of Applied Science & Engineering", "department": "Civil and Mineral Engineering", "prerequisites": "MIN466H1", "exclusions": "", "level": 400, "campus": "UTSG", "term": "2019 Winter", "breadths": [], "meeting_sections": [{"code": "L0101", "instructors": ["D Eden"], "times": [{"day": "WEDNESDAY", "start": 36000, "end": 39600, "duration": 3600, "location": "MB 500"}], "size": 30, "enrolment": 0}, {"code": "P0101", "instructors": [], "times": [{"day": "THURSDAY", "start": 50400, "end": 64800, "duration": 14400, "location": "MB 402"}], "size": 30, "enrolment": 0}, {"code": "T0101", "instructors": [], "times": [{"day": "WEDNESDAY", "start": 39600, "end": 43200, "duration": 3600, "location": "MB 500"}], "size": 30, "enrolment": 0}]}