{"id": "MUN105Y1Y20189", "code": "MUN105Y1Y", "name": "Global Problem-Solving: Laboratory Opportunities", "description": "This course teaches students how to conduct analytically rigorous social science research to improve their insights into complex global problems and devise innovative solutions to address them. A unique feature of this class is that students have the opportunity to learn by doing. Students work hands-on in one of several labs dealing with some of the most intractable global problems of our time in the areas of the environment, health, digital governance, security and the gap between rich and poor. By the end of this course students will be able to:  Experience and practice the process of social science research  Narrow the scope of a complex global challenge into a manageable research problem that can be tackled over the course of the semester Improve their knowledge and insights on a particular global problem Develop a viable, compelling and implementable solution that can help address an aspect of a global problem Pitch a solution in a compelling way to a jury of experts in global affairs  Students will work with their peers in small seminar classes and lab group settings, mentored by graduate teaching assistants specializing in global affairs, expert faculty and senior policy advisors dedicated to addressing global issues in the fields of the environment, health, security, digital governance and political economy. Not eligible for CR/NCR option.", "division": "Faculty of Arts and Science", "department": "Munk School of Global Affairs and Public Policy", "prerequisites": "Admission to Munk One", "exclusions": "Exclusion: Innis One, New One, St. Mike's One, Trinity One, UC One, Vic One, Woodsworth One", "level": 100, "campus": "UTSG", "term": "2018 Fall", "breadths": [3], "meeting_sections": [{"code": "L0101", "instructors": ["T Kramarz"], "times": [{"day": "THURSDAY", "start": 36000, "end": 43200, "duration": 7200, "location": "SK 720"}], "size": 30, "enrolment": 0}]}