{"id": "MUN102H1S20191", "code": "MUN102H1S", "name": "Global Innovation II: Challenges and Solutions", "description": "Governing public goods has been an age-old concern for social scientists and policymakers alike. This is not surprising since the provision of global public goods is riddled by problems of collective action. In this course, we focus on how to implement solutions through states, markets and communities. The first objective is to familiarize students with the concept of global public goods, the different mechanisms that can provide these goods and the challenges that emerge from lacking incentives to secure their provision. To this end, the course will introduce theories from sociology, political science, philosophy, and history to help us understand different types of governance mechanisms and how they may be used to scale global solutions. Theories can help us explain the tensions between cooperating for the public good at the expense of sacrificing individual goals, or why certain areas of our lives, like the Internet, seem to produce public goods without any formal mechanism of cooperation. The second objective is to use the class and subject of study as an arena to model and practice the kind of learning that is expected of university students. The main skills that the course will help students target and develop are: research (finding, evaluating and assimilating reliable information); writing (developing ideas into logically written arguments); and critical analysis of arguments presented in the readings and debated in class (this includes identifying the key assumptions that are implicit in different theories as well as inherent in our own positions on various questions related to governance). Not eligible for CR/NCR option.", "division": "Faculty of Arts and Science", "department": "Munk School of Global Affairs and Public Policy", "prerequisites": "Admission to Munk One", "exclusions": "Innis One, New One, St. Mike's One, Trinity One, UC One, Vic One, Woodsworth One", "level": 100, "campus": "UTSG", "term": "2019 Winter", "breadths": [3], "meeting_sections": [{"code": "L0101", "instructors": ["T Kramarz"], "times": [{"day": "TUESDAY", "start": 50400, "end": 57600, "duration": 7200, "location": "SK 348"}], "size": 30, "enrolment": 0}]}